const PlantRecomendationsData = [
  {
    plant_id: 1,
    watering:
      "Поливы проводят по мере подсыхания верхнего слоя земли регулярно, но небольшими объёмами. Подкормки раствором комплексного минерального удобрения проводят каждые 14 дней, начиная с третьей недели после высадки.",
    sunlight:
      "Для хорошего плодоношения земляника требует много солнечного света. Подойдут балконы, ориентированные на юг и юго-запад.",
    pruning: "нет",
    specialist_recomendation: `Обрезка клубники — это процедура, цель которой — повысить урожайность.
    Выполняют её следующим образом:    
    На рассаде, выращенной из семян, срывают несколько первых цветков.    
    Обрывать цветоносы на клубнике, посаженной саженцами, не нужно.    
    Если нужно заменять взрослые кусты и новые растения не требуются, необходимо аккуратно удалять усы.    
    В результате этой процедуры растения не будут тратить силы на формирование ненужных розеток, а направят все питательные вещества к плодам.`,
    createdAt: new Date(),
    updatedAt: new Date(),
  },
  {
    plant_id: 2,
    watering: "Поливать растение надо регулярно и умеренно, но при этом почва в горшке должна быть всегда слегка увлажнена. В летнее время поливать надо обильно. В любое время года полив следует производить только после того, как верхний слой почвы просохнет. Не допускайте переувлажнения земли, а особенно застоя в ней жидкости даже на сравнительно недолгий период. Помните, что чрезмерная влажность представляет большую опасность, чем засуха (однако ее тоже по возможности лучше избегать). Для полива подойдет лишь мягкая вода. Избегайте полива холодной водой. В зимнее время рекомендуется поливать тепловатой водой, а весной и осенью она должна быть комнатной температуры.",
    sunlight: "Очень любит свет. При этом стоит помнить, что данный фикус отличается от остальных тем, что не может нормально расти и развиваться даже при небольшом затенении. В летнее время его рекомендуется защищать от прямых лучей солнца, но при этом стоит выбрать для размещения самое светлое место. А можно просто поместить его на окно южной ориентации, но при этом сделать свет рассеянным. При наступлении холодного времени года и сокращении светового дня цветок необходимо перенести в наиболее освещенное место, также ему рекомендуется устраивать досветку специальными лампами.",
    pruning: `Растение требует постоянной коррекции. Здесь свои правила. Выполнять их желательно.

    Нельзя обрезать фикус в начале активации, это приведет к ослаблению растения. Не нужно проводить обрезку в феврале или марте, это слишком рано, фикус только готовится к вегетации, не нужно его ослаблять. Если Панду планируется пересаживать, то обрезку производят только после ее адаптации на новом месте.
    Корректирующую и санитарную обрезку делают в мае и летом. Обрезают поврежденные веточки. Срезают часть(до половины) вытянувшихся побегов. Цель обрезки — сформировать пышную крону. Поэтому обрезают в верхней части куста все длинные побеги. Можно их укоротить до 1/3 от длины.
    Крону можно формировать по своему усмотрению. Создавать нужные вам силуэты. Панда не против обрезки. И после нее быстро сможет восстановиться.
    В ветках и побегах, где была выполнена обрезка, начинается усиленный рост. Это нужно учитывать. Ведь при активном росте начнет меняться весь силуэт.
    Проводят омолаживающую обрезку: все ветки срезаются на одну треть. Если растение сильно угнетено, то иногда только обрезка всех побегов на половину от длины, может спасти фикус.
    Если вообще не обрезать Панду, то необходимо устанавливать подпорки под сильно вытянувшиеся побеги. Наросшие листья утяжеляют ветки, они могут сломаться от тяжести.
    `,
    specialist_recomendation: `Правила ухода за таким растением очень схожими с теми, что применяются для выращивания иных фикусов (только они немного посложней). Наиболее сложным в уходе за данным фикусом является поддержание стабильной среды, а именно, нужно, чтобы температура и освещенность резко не изменялись, и постоянно были на одном уровне. Также необходима повышенная влажность воздуха и требуется защита от сквозняков. Чем лучше ухаживать за «Пандой», тем наряднее и эффектнее она будет выглядеть.`,
    createdAt: new Date(),
    updatedAt: new Date(),
  },
  {
    plant_id: 3,
    watering: "Поливать нужно умеренно в течение всего года.",
    sunlight: "Лучше всего такое растение развивается в ярко-освещенном, солнечном месте, однако его вполне можно выращивать и в полутени. Летом пальму нужно защищать от прямых палящих лучей полуденного солнца. Чтобы она развивалась равномерно, специалисты советуют, систематически поворачивать емкость с растением таким образом, чтобы кончик молодого листа был направлен внутрь комнаты. В летнее время рекомендуется перенести пальму на улицу.",
    pruning: `В обрезке брахея не нуждается.
    Однако для поддержания декоративности растения следует удалять засохшие листовые пластины и отмирающие боковые отростки.`,
    specialist_recomendation: `Несмотря на свою красоту и неприхотливость, брахея подвержена атакам вредителей. Часто встречаются щитовки, тля и мучнистые червецы. Для борьбы с ними используются специальные препараты.
    Брахея – прекрасное домашнее растение, способное украсить любой интерьер своими красками. Следуя простым правилам ухода, вы сможете наслаждаться его великолепием в течение многих лет. Станьте гордым обладателем этого удивительного комнатного цветка и наслаждайтесь его великолепием каждый день!`,
    createdAt: new Date(),
    updatedAt: new Date(),
},
];

module.exports = PlantRecomendationsData;
